Repository: progval/Supybot-plugins
Catalog: Trivia/locale/*.po
Languages: de

source: The character used for a blank when displaying hints
de: Das Zeichen das als blankes Zeichen bei Tipps benutzt wird.

source: The number of hints to be given for each question
de: Die Nummer der Tipps die pro Frage gegeben werden.

source: The number of seconds to allow for each question
de: Die Anzahl der Sekunden für jede Frage.

source: The fraction of the answer that should be revealed with each hint
de: Der Anteil der Frage die mit jedem Tipp preisgegeben wird.

source: The flexibility of the trivia answer checker. One typo will be allowed for every __ characters.
de: Die Flexibilität des Fragencheckers. Ein Fehler wird alle __ Zeichen erlaubt.

source: The mIRC color to use for trivia questions
de: Die mIRC Frage für Quizfragen.

source: The number of questions that can go unanswered before the trivia stops automatically.
de: Die Anzahl der Fragen die unbeantwortet bleiben können, bevor das Quiz automatisch stoppt.

source: The path to the scores file. If it doesn't exist, it will be created.
de: Der Pfad zur Punktedatei. Falls diese nicht existiert wird sie erstellt.

source: The path to the questions file. If it doesn't exist, it will be created.
de: Der Pfad zur Fragendatei. Falls diese nicht existiert wird sie erstellt.

source: The default number of questions to be asked in a round of trivia.
de: Die Standardanzahl an Fragen die in einer Quizrunde gestellt werden.

source: The separator used between the questions and answers in your trivia file.
de: Der Seperator zwischen Fragen und Antworten in deiner Triviadatei.

source: Seems like no one's playing any more.
de: Ich glaube es spielt niemand mehr.

source: Oops! I ran out of questions!
de: Ups! Ich habe keine Fragen mehr!

source: %s#%d of %d: %s
de: %s#%d aus %d: %s

source: Trivia stopping.
de: Quiz wird gestoppt.

source: Top finishers:
de: Top Spieler:

source: No one got the answer! It was: %s
de: Niemand hatte die Antwort! Die Antwort war: %s

source: HINT: %s%s
de: Tipp: %s%s

source: %s got it! The full answer was: %s. Points: %d
de: %s hat es richtig! Die volle Antwort war: %s. Punkte: %d

source: [<channel>] [<number of questions>] Starts a game of trivia. <channel> is only necessary if the message isn't sent in the channel itself.
de: [<Kanal>] [<Anzahl der Fragen>] Startet ein neues Quiz. <Kanal> wird nur benötigt falls der Befehl nicht im Kanal gegeben wird.

source: Orphaned trivia game found and removed.
de: Verwaistes Quiz gefunden und entfernt.

source: %d questions added to active game!
de: %d Fragen zum aktiven Spiel hinzugefügt!

source: [<channel>] Stops a running game of trivia. <channel> is only necessary if the message isn't sent in the channel itself.
de: [<Kanal>] Stoppt das laufende Quiz. <Kanal> wird nur benötigt falls der Befehl nicht im Kanal gegeben wird.

source: No trivia started
de: Es läuft kein Quiz.

source: Trivia stopped
de: Quiz gestoppt
