Repository: progval/Supybot-plugins
Catalog: LinkRelay/locales/*.po
Languages: fi, fr, it

source: Value must be a valid color number (01, 02, 03, 04, ..., 16)
fi: Arvon täytyy olla kelvollinen värikoodin numero (01, 02, 03, 04, ..., 16
fr: La valeur doit être un code de couleur valide (01, 02, 03, 04, ..., 16)
it: Il valore deve essere un numero di colore valido (01, 02, 03, 04, ..., 16).

source: Determines whether the bot will color Relayed PRIVMSGs so as to make the messages easier to read.
fi: Määrittää värjääkö botti välitetyt PRIVMSG-viestit helppolukuisuuden vuoksi.
fr: Détermine si le bot colorera les PRIVMSG relayés, de façon à rendre leur lecture plus aisée.
it: Determina se il bot colorerà i PRIVMSG inoltrati per renderne più semplice la lettura.

source: Determines whether the bot will synchronize topics between networks in the channels it Relays.
fi: Määrittää synkronoiko botti kanavien otsikot kaikkien verkkojen välillä niillä kanavilla joita se välittää.
fr: Détermine si le bot synchronisera les topics entre les différents canaux qu'il relaye.
it: Determina se il bot sincronizzerà i topic tra le reti nei canali in cui inoltra.

source: Determines whether the bot will Relay the hostmask of the person joining or parting the channel when they join or part.
fi: Määrittää välittääkö botti kanavalle liittyvän tai kanavalta poistuvan henkilön hostmaskin, hänen liittyessään/poistuessaan.

source: Determines whether the bot will relay the nick of the person sending a message.
fi: Määrittää välittääkö botti kanavalle liittyvän tai kanavalta poistuvan henkilön hostmaskin, kun hänen litttyessään/poistuessaan.

source: Determines whether the bot will include the network in Relayed PRIVMSGs; if you're only Relaying between two networks, it's somewhat redundant, and you may wish to save the space.
fi: Määrittää sisältääkö botti verkon välitetyissä PRIVMSGeissä; jos välität vain kahden verkon välillä, se on aika tarpeetonta, ja saatat tahtoa säästää tilaa.
fr: Détermine si le bot incluera le nom du réseau dans les PRIVMSG relayés ; si vous relayez uniquement entre deux réseaux, ce sera quelque chose de redondant et d'inutile, qu'il vaut mieux supprimer pour garder de la place.
it: Determina se il bot includerà la rete nei PRIVMSG inoltrati; se si trasmette tra due sole reti è alquanto ridondante e si preferirà risparmiare spazio.

source: You shouldn't edit this configuration variable yourself unless you know what you do. Use @LinkRelay {add|remove} instead.
fi: Tätä asetusarvoa ei pitäisi muokata, ellei tiedetä mitä teet. Komentoja @LinkRelay {add|remove} pitäisi käyttää tämän muokkaamiseen..
fr: Vous ne devriez pas éditer cette variable de configuration à moins de savoir ce que vous faites. Utilisez plutôt @LinkRelay {add|remove}.
it: Non dovresti modificare questa variabile di configurazione a meno che non sai cosa fare; usa invece "@LinkRelay {add|remove}".

source: Color used for relaying %s.
fi: Välittämiseen käytettävä väri on %s
fr: Couleur utilidée pour relayer les %s.
it: Colore utilizzato per inoltrare le %s.

source: Advanced message relay between channels.
fi: Edistynyt viestien välittäjä kanavien välillä.

source: This is no relay enabled. Use "linkrelay add" to add one.
fi: Välitystä ei ole käytössä. Käytä komentoa "linkrelay add" lisätäksesi välityksen.

source: truncated
fi: katkaistu
fr: tronqué
it: troncato

source: --> %(nick)s has joined %(channel)s%(network)s
fi: --> %(nick)s on liittynyt verkossa %(channel)s%(network)s
fr: --> %(nick)s a rejoint %(channel)s%(network)s
it: --> %(nick)s è entrato in %(channel)s%(network)s

source: <-- %(nick)s has left %(channel)s%(network)s
fi: <-- %(nick)s on poistunut verkossa %(channel)s%(network)s
fr: <-- %(nick)s est parti de %(channel)s%(network)s
it: <-- %(nick)s ha lasciato %(channel)s%(network)s

source: */* %(oldnick)s (%(network)s) changed their nickname to %(newnick)s
fi: */* Käyttäjä %(oldnick)s (%(network)s) tunnetaan nyt nimellä %(newnick)s:ksi.

source: <-- %(nick)s has quit on %(network)s (%(message)s)
fi: <-- %(nick)s on lopettanut verkossa %(network)s (%(message)s)
fr: %(nick)s a quitté %(network)s (%(message)s)
it: <-- %(nick)s è uscito da %(network)s (%(message)s)

source: [<channel>] Returns the nicks of the people in the linked channels. <channel> is only necessary if the message isn't sent on the channel itself.
fi: [<kanava>] Palauttaa linkitetyillä kanavilla olevien nimimerkit. <Kanava> on vaadittu vain, jos viestiä ei lähetetä kanavalla itsellään.
fr: [<canal>] Retourne les nicks des personnes dans les canaux linkés. <canal> n'est nécessaire que si le message n'est pas envoyé sur le canal lui-même.
it: [<canale>] Riporta i nick degli utenti presenti nei canali collegati. <canale> è necessario solo se il messaggio non viene inviato nel canale stesso.

source: Not connected to network %s.
fi: Yhteyttä verkkoon %s ei ole muodostettu.

source: %d users in %s on %s: %s
fi: %d käyttäjiä verkossa %s kanavalla %s: %s
fr: %d utilisateurs sur %s sur %s : %s
it: %d utenti in %s su %s: %s

source: You must give at least --from or --to.
fi: Sinun täytyy antaa vähintään --from tai --to.
fr: Vous devez donner au moins --from ou --to.
it: Devi fornire almeno --from o --to.

source: --from should be like "--from #channel@network"
fi: --from pitäisi näyttää tältä: "--from #kanava@verkko"
fr: --from doit être de la forme "--from #canal@reseau"
it: --from deve essere nella forma "--from #canale@rete"

source: --to should be like "--to #channel@network"
fi: --to pitäisi näyttää tältä: "--to #kanava@verkko"
fr: --to doit être de la forme "--to #canal@reseau"
it: --to deve essere nella forma "--to #canale@rete"

source: [--from <channel>@<network>] [--to <channel>@<network>] [--regexp <regexp>] [--reciprocal] Adds a relay to the list. You must give at least --from or --to; if one of them is not given, it defaults to the current channel@network. Only messages matching <regexp> will be relayed; if <regexp> is not given, everything is relayed. If --reciprocal is given, another relay will be added automatically, in the opposite direction.
fi: [--from <kanava>@<verkko>] [--to <kanava>@<verkko>] [--regexp <säännöllinen lauseke>] [--reciprocal] Lisää välityksen listaan. Sinun täytyy antaa vähintään --from tai --to; jos yhtä niistä ei ole annettu, se on oletuksenä nykyinen kanava@verkko. Vain viestit, jotka täsmäävät <säännölliseen lausekkeeseen> välitetään; jos <säännöllinen lauseke> ei ole annettu, kaikki välitetään. Jos --reciprocal on annettu, toinen välitys lisätään, vastapäiseen suuntaan.
fr: [--from <canal>@<reseau>] [--to <canal>@<reseau>] [--regexp <regexp>] [--reciprocal] Ajoute un relay à la liste. Vous devez donner au moins --from ou --to ; si l'un des deux n'est pas donné, il correspondra par défaut au canal@reseau courant. Seuls les messages correspondant à la <regexp> seront relayés ; si la <regexp> n'est pas donnée, tout est relayé. Si --reciprocal est donné, un autre relai sera ajouté automatiquement, dans le sens inverse.
it: [--from <canale>@<rete>] [--to <canale>@<rete>] [--regexp <regexp>] [--reciprocal] Aggiunge un inoltro all'elenco. Devi fornire almeno --from o --to; se uno di questi non è fornito usa il valore attuale di canale@rete. Verranno inoltrati solo i messagggi che corrispondono a <regexp>; se questa non è fornita verrà inoltrato tutto. Se --reciprocal è specificato verrà automaticamente aggiunto un inoltro nella direzione opposta.

source: One (or more) relay(s) already exists and has not been added.
fi: Yksi (tai useampi) välitys on jo olemassa ja sitä ei lisätty.
fr: Un (ou plusieurs) relai(s) existe déjà et n'a pas été ajouté.
it: Esistono già uno o più inoltri e non sono stati aggiunti.

source: [--from <channel>@<network>] [--to <channel>@<network>] [--regexp <regexp>] [--reciprocal] Remove a relay from the list. You must give at least --from or --to; if one of them is not given, it defaults to the current channel@network. Only messages matching <regexp> will be relayed; if <regexp> is not given, everything is relayed. If --reciprocal is given, another relay will be removed automatically, in the opposite direction.
fi: [--from <kanava>@<verkko>] [--to <kanava>@<verkko>] [--regexp <säännöllinen lauseke>] [--reciprocal] Poistaa välityksen listasta. Sinun täytyy antaa vähintään --from tai --to; jos yksi tai useampi niistä ei ole annettu, se on oletuksena nykyinen kanava@verkko. Vain viestit, jotka täsmäävät <säännölliseen lausekkeeseen> välitetään; jos <säännöllinen lauseke> ei ole annettu, kaikki välitetään. Jos --reciprocal on annettu, toinen välitys poistetaan automaattisesti, vastapäisessä suunnassa.
fr: [--from <canal>@<reseau>] [--to <canal>@<reseau>] [--regexp <regexp>] [--reciprocal] Supprime un relay à la liste. Vous devez donner au moins --from ou --to ; si l'un des deux n'est pas donné, il correspondra par défaut au canal@reseau courant. Seuls les messages correspondant à la <regexp> seront relayés ; si la <regexp> n'est pas donnée, tout est relayé. Si --reciprocal est donné, un autre relai sera supprime automatiquement, dans le sens inverse.
it: [--from <canale>@<rete>] [--to <canale>@<rete>] [--regexp <regexp>] [--reciprocal] Rimuove un inoltro dall'elenco. Devi fornire almeno --from o --to; se uno di questi non è fornito usa il valore attuale di canale@rete. Verranno inoltrati solo i messagggi che corrispondono a <regexp>; se questa non è fornita verrà inoltrato tutto. Se --reciprocal è specificato verrà automaticamente rimosso un inoltro nella direzione opposta.

source: One (or more) relay(s) did not exist and has not been removed.
fi: Yksi (tai useampi) välitys ei ollut olemassa, joten sitä ei ole poistettu.
fr: Un (ou plusieurs) relai(s) n'existe pas et n'a pas été supprimé.
it: Esistono già uno o più inoltri e non sono stati rimossi.

source: <regexp> <replacement> Replaces all nicks that matches the <regexp> by the <replacement> string.
fi: <säännöllinen lauseke> <korvaus> Korvaa kaikki nimimerkit, jotka täsmäävät <säännölliseen lausekkeeseen> <korvaavalla> merkkiketjulla.
fr: <regexp> <remplacement> Remplace tous les nicks correspondant à la <regexp> par la chaîne de <remplacement>.
it: <regexp> <rimpiazzo> Sostituisce con la stringa <rimpiazzo> tutti i nick che corrispondono a <regexp>.

source: <regexp> Undo a substitution.
fi: <säännöllinen lauseke> Kumoa korvaaminen.
fr: <regexp> Défait une substitution.
it: <regexp> Annulla una sostituzione.

source: This regexp was not in the nick substitutions database
fi: Tämä säännöllinen lauseke ei ollut nimimerkkien korvaus tietokannassa.
fr: Cette regexp n'est pas dans la base de données des substitutions de nicks.
it: Questa regexp non è nel database delle sostituzioni dei nick.

source: You shouldn't edit this configuration variable yourself unless you know what you do. Use @LinkRelay (no)substitute instead.
fr: Vous ne devriez pas éditer cette variable de configuration à moins de savoir ce que vous faites. Utilisez plutôt @LinkRelay (nosubstitute)
it: Non dovresti modificare questa variabile di configurazione a meno che non sai cosa fare; usa invece "@LinkRelay (no)substitute".

source: takes no arguments Returns all the defined relay links
fr: ne prend pas d'argument Retourne tous les relais définis.
it: non necessita argomenti Riporta tutti i link di inoltro definiti.

source: */* %(nick)s changed mode on %(channel)s%(network)s to %(mode)s
fr: */* %(nick)s a défini les modes de %(channel)s%(network)s : %(mode)s
it: */* %(nick)s ha cambiato il mode di %(channel)s in %(mode)s

source: <-- %(kicked)s has been kicked from %(channel)s%(network)s by %(kicker)s (%(message)s)
fr: <-- %(kicked)s a été kické de %(channel)s%(network)s par %(kicker)s (%(message)s)
it: <-- %(kicked)s è stato cacciato da %(channel)s%(network)s da %(kicker)s (%(message)s)
