Repository: progval/Supybot-plugins
Catalog: Twitter/locale/*.po
Languages: fr

source: running get_access_token.py is a way to get it
fr: lancer get_access_token.py est une manière de l'obtenir

source: The Twitter Access Token key for the bot's account (%s)
fr: La clef d'accès Twitter au compte du bot (%s)

source: The Twitter Access Token secret for the bot's account (%s)
fr: La chaîne secrète d'accès Twitter au compte du bot (%s)

source: The URL to the base API URL (by default, it is Twitter.com, but you can use it for twitter-compatible services, such as identica/statusnet.
fr: L'URI vers l'URL de base de l'API (par défaut, il s'agit de Twitter.com, mais vous pouvez aussi l'utiliser pour des services compatibles avec Twitter, comme identica/statusnet).

source: The Twitter Access Token key for this channel's account (%s)
fr: La clef d'accès Twitter au compte de ce canal (%s)

source: The Twitter Access Token secret for this channel's account (%s)
fr: La chaîne secrète d'accès Twitter au compte de ce canal (%s)

source: I just woke up. :)
fr: Je viens de me réveiller :)

source: [<channel>] [<user>] Replies with the friends (i.e. people who one subscribes to) of the <user>. If <user> is not given, it defaults to the <channel>'s account. If <channel> is not given, it defaults to the current channel.
fr: [<canal>] [<utilisateur>] Répond avec les amis (c'est à dire les personnes auquelles quelqu'un s'abonne) de l'<utilisateur>. Si l'<utilisateur> n'est pas donné, il correspond par défaut au compte du <canal>. Si le <canal> n'est pas donné, il correspond par défaut au canal courant.

source: No account is associated with this channel. Ask an op, try with another channel, or provide a user name.
fr: Aucun compte n'est associé à ce canal. Demande à un op, essayez avec un autre canal, ou donnez un nom d'utilisateur.

source: [<channel>] <message> Updates the status of the account associated with the given <channel> to the <message>. If <channel> is not given, it defaults to the current channel.
fr: [<canal>] <message> Modifie le statut du compte associé avec le <canal> donné. Si le <canal> n'est pas donné, il correspond par défaut au canal courant.

source: No account is associated with this channel. Ask an op or try with another channel.
fr: Aucun compte n'est associé à ce canal. Demandez à un op, ou essayez avec un autre canal.

source: Sorry, your tweet exceeds 140 characters (%i)
fr: Désolé, votre tweet excède 140 caractères (%i).

source: [<channel>] [<user>] [--since <oldest>] [--max <newest>] [--count <number>] [--noretweet] Replies with the timeline of the <user>. If <user> is not given, it defaults to the account associated with the <channel>. If <channel> is not given, it defaults to the current channel. If given, --since and --max take tweet IDs, used as boundaries. If given, --count takes an integer, that stands for the number of tweets to display. If --noretweet is given, only native user's tweet will be displayed.
fr: [<channel>|<user>] [--since <ancien>] [--max <récent>] [--count <nombre>] [--noretweet] Répond avec la timeline de l'<utilisateur>.Si l'<utilisateur> n'est pas donné, il correspond par défaut au compte associé au <canal>. Si le <canal> n'est pas donné, il correspond par défaut au canal courant.Si ils sont donnés, --since et --max prennent chacun un ID de tweet, utilisés comme "frontières" de la requête de tweets.Si il est donné, --count prend un entier, qui correspond au nombre de tweets à afficher. Si --noretweet est donné, seuls les tweets natifs de l'utilisateur seront affichés.

source: No account is associated with this channel. Ask an op, try with another channel.
fr: Aucun compte n'est associé à ce canal. Demandez à un op, ou essayez avec un autre canal.

source: This user protects his tweets; you need to fetch them from a channel whose associated account can fetch this timeline.
fr: Cet(te) utilisateur(trice) protège ses tweets ; vous devez les récupérer à partir d'un canal dont le compte Twitter associé peut récupérer cette timeline.

source: [<channel>] [--since <oldest>] Replies with the public timeline. If <channel> is not given, it defaults to the current channel. If given, --since takes a tweet ID, used as a boundary
fr: [<canal>] [--since <id>] Répond avec la timeline publique, en tant que l'utilisateur associé au <canal>. Si <canal> n'est pas donné, il correspond par défaut au canal courant. Si il est donné, --since prend un ID de tweet, qui est utilisé en tant que borne

source: No tweets
fr: Aucun tweet.

source: [<channel>] [--since <oldest>] Replies with the replies timeline. If <channel> is not given, it defaults to the current channel. If given, --since takes a tweet ID, used as a boundary
fr: [<canal>] [--since <id>] Répond avec la timeline de réponses, en tant que l'utilisateur associé au <canal>. Si <canal> n'est pas donné, il correspond par défaut au canal courant. Si il est donné, --since prend un ID de tweet, qui est utilisé en tant que borne

source: [<channel>] <user> Follow a specified <user> If <channel> is not given, it defaults to the current channel.
fr: [<canal>] <utilisateur> Suit l'<utilisateur> en tant que l'utilisateur associé au <canal>. Si <canal> n'est pas donné, il correspond par défaut au canal courant.

source: An error occurred
fr: Une erreur est survenue.

source: [<channel>] <user> Unfollow a specified <user> If <channel> is not given, it defaults to the current channel.
fr: [<canal>] <utilisateur> Cesse de suivre l'<utilisateur> en tant que l'utilisateur associé au <canal>. Si <canal> n'est pas donné, il correspond par défaut au canal courant.
