Repository: progval/Supybot-plugins
Catalog: Brainfuck/locale/*.po
Languages: fi

source: Got `]` (at index %i), expected whatever you want but not that.
fi: Saatiin `]` (indeksissä %i), oleta mitä tahansa, mutta et tahdo sitä.

source: Got end of string, expected `]`.
fi: Saatiin merkkiketjun loppu, oletettu `[`.

source: Negative memory pointer.
fi: Negatiivinen muisti osoittaja.

source: Add the help for "@plugin help Brainfuck" here This should describe *how* to use this plugin.
fi: Lisää ohje komennolle "@plugin help Brainfuck" tähän. Tämän pitäisi kuvata *kuinka* tätä lisäosaa käytetään.

source: <command> Tests the Brainfuck syntax without running it. You should quote the code if you use brackets, because Supybot would interpret it as nested commands.
fi: <komento> Kokeilee Brainfuck syntaksia suorittamatta sitä. Koodi pitäisi pitää lainausmerkeissä, ettei Supybot tulkitse sitä sisäkkäiseksi komennoksi.

source: Your code looks ok.
fi: Koodisi näyttää kelvolliselta.

source: [--recover] [--input <characters>] <command> Interprets the given Brainfuck code. You should quote the code if you use brackets, because Supybot would interpret it as nested commands. If --recover is given, the bot will recover the previous processor memory and memory pointer. The code will be fed the <characters> when it asks for input.
fi: [--recover] [--input <merkkejä>] <komento> Tulkkaa annetun Brainfuck koodin. Koodin pitäisi olla lainausmerkeissä, koska muuten Supybot voi tulkita sen sisäkkäisiksi komennoiksi. Jos --recover on annettu, botti palauttaa edellisen suorituksen muistista ja muisti osoittajasta. Koodi syötetään <merkkeinä>, kun se pyytää sisääntuloa.

source: No processor has been run for the moment.
fi: Käsittelyä ei ole suoritettu hetkeen.

source: Brainfuck syntax error: %s
fi: Brainfuck syntaksi virhe: %s

source: Brainfuck processor timed out.
fi: Brainfuck käsittely aikakatkaistu.

source: Input too short.
fi: Sisääntulo on liian lyhyt.

source: Segmentation fault: %s
fi: Segmentointi vika: %s

source: Tried to output invalid character: %s
fi: Yritettiin tulostaa virheellinen merkki : %s
