Repository: progval/Supybot-plugins
Catalog: Eureka/locale/*.po
Languages: fi

source: Determines the format used by the bot to display the score of a user.
fi: Määrittää muodon, jota botti käyttää näyttääkseen käyttäjän pistemäärän.

source: Determines the string between two user scores.
fi: Määrittää merkkiketjun, joka on käyttäjän kahden tuloksen välissä.

source: Add the help for "@plugin help Eureka" here This should describe *how* to use this plugin.
fi: Lisää ohje komennolle "@plugin help Eureka" tähän. Tämän pitäisi kuvata *miten* tätä lisäosaa käytetään.

source: Nobody replied with (one of this) answer(s): %s.
fi: Kukaan ei vastannut yhdellä näistä vastauksista: %s.

source: Another clue: %s
fi: Toinen vihje: %s

source: Congratulations %s! The answer was %s.
fi: Onneksi olkoon %s! Vastaus oli %s.

source: Another valid answer is: '%s'.
fi: Toinen kelvollinen vastaus on: '%s'.

source: Other valid answers are: '%s'.
fi: Muut kelvolliset vastaukset ovat: '%s'.

source: [<channel>] Return the scores on the <channel>. If <channel> is not given, it defaults to the current channel.
fi: [<kanava>] Palauttaa <kanavan> pistemäärät. Jos <kanava> ei ole annettu, se on oletuksena nykyinen kanava.

source: Eureka is not enabled on this channel
fi: Eureka ei ole käytössä tällä kanavalla

source: Noone played yet.
fi: Kukaan ei ole pelannut vielä.

source: [<channel>] <nick> Return the score of <nick> on the <channel>. If <channel> is not given, it defaults to the current channel.
fi: [<kanava>] <nimimerkki> Palautaa <nimimerkin> pistemäärän <kanavalla>. Jos <kanava> ei ole annettu, se on oletuksena nykyinen kanava.

source: This user did not play yet.
fi: Kyseinen käyttäjä ei pelannut vielä.

source: [<channel>] Start the Eureka on the given <channel>. If <channel> is not given, it defaults to the current channel.
fi: [<kanava>] Käynnistää Eurekan annetulla <kanavalla>. Jos <kanava> ei ole annettu, se on oletuksena nykyinen kanava.

source: Eureka is already enabled on this channel
fi: Eureka on jo otettu käyttöön tälle kanavalle.

source: [<channel>] Stop the Eureka on the given <channel>. If <channel> is not given, it defaults to the current channel.
fi: [<kanava>] Pysäyttää Eurekan annetulla <kanavalla>. Jos <kanava> ei ole annettu, se on oletuksena nykyinen kanava.

source: [<channel>] Pause the Eureka on the given <channel>. If <channel> is not given, it defaults to the current channel.
fi: [<kanava>] Laita tauko Eurekaan annetulla <kanavalla>. Jos <kanava> ei ole annettu, se on oletuksena nykyinen kanava.

source: Eureka is already paused.
fi: Eureka on jo tauotettu.

source: [<channel>] Resume the Eureka on the given <channel>. If <channel> is not given, it defaults to the current channel.
fi: [<kanava>] Jatkaa Eurekaa annetulla <kanavalla>. Jos <kanava> ei ole annettu, se on oletuksena nykyinen kanava.

source: Eureka is not paused.
fi: Eureka ei ole tauolla.

source: [<channel>] <nick> <number> Increase or decrease the score of <nick> on the <channel>. If <channel> is not given, it defaults to the current channel.
fi: [<kanava>] <nimimerkki> <numero> Nostaa tai vähentää <nimimerkin> pistemäärää <kanavalla>. Jos <kanava> ei ole annettu, se on oletuksena nykyinen kanava.

source: [<channel>] Give up with this question, and switch to the next one.
fi: [<kanava>] Luovuta tämä vastaus, ja siirry seuraavaan.

source: [<channel>] Give the next clue.
fi: [<kanava>] Anna seuraava vihje.
