Repository: progval/Supybot-plugins
Catalog: ERepublik/locale/*.po
Languages: fi

source: This citizen does not exist.
fi: Kyseinen kansalainen ei ole olemassa.

source: <name|id> Displays informations on the given citizen.
fi: <nimi|id> Näyttää tiedot annetusta kansalaisesta.

source: <name|id> Displays the citizen's medals.
fi: <nimi|id> Näyttää kansalaisen arvomerkit.

source: %s has the fellowing medal(s): %s
fi: %s omistaa seuraavat mitali(n/s): %s

source: <name> Displays money's rates.
fi: <nimi> Näyttää rahan korot.

source: <channel> Calls for invasion of the channel.
fi: <kanava> Kutsuu kanavan invaasion.

source: PREPARE FOR ORGANIZED JUMP INTO THE CHANNEL
fi: VALMISTAUDU ORGANISOITUUN HYPPYYN KANAVALLE

source: Join %s !
fi: Liity %s !

source: <user|id> Returns the link to the user's profile.
fi: <käyttäjä|id> Palauttaa linkin käyttäjän profiiliin.

source: <user|id> Returns the link to the user's 'donate' page.
fi: <käyttäjä|id> Palauttaa linkin käyttäjän 'lahjoitus' sivulle.

source: take no arguments Returns the eRepublik main links.
fi: ei ota parametrejä Palauttaa eRepublikin päälinkit.

source: take no arguments Returns the eRepublik land links.
fi: ei ota parametrejä Palauttaa eRepublikin maalinkit.

source: <name|id> Shows how many damages you can make in one hit.
fi: <nimi|id> Näyttää kuinka paljon vahinkoa voit tehdä yhdellä lyönnillä.

source: damages: %i
fi: vahingot: %i

source: kamikaze attack with full food: %i
fi: kamikaze hyökkäys täydellä ruualla: %i
